{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 1,
      "scale" : 0.0039215688593685627
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_1__activation___output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 4,
      "name" : "conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 4,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_1__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_1",
      "top" : "max_pooling2d_1_output"
    },
    {
      "name" : "batch_normalization_1",
      "bottom" : "max_pooling2d_1_output",
      "weights" : {

      },
      "top" : "batch_normalization_1_output",
      "C" : 96,
      "blob_batchnorm_params" : 5,
      "type" : "batchnorm"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_1_output",
      "pad_pad_mode" : 0,
      "pad_t" : 2,
      "pad_r" : 2,
      "pad_b" : 2,
      "type" : "general_padding",
      "pad_fill_mode" : 0,
      "bottom" : "batch_normalization_1_output",
      "pad_l" : 2,
      "name" : "zero_padding2d_1",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_2__activation___output",
      "blob_weights" : 9,
      "K" : 96,
      "blob_biases" : 7,
      "name" : "conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "zero_padding2d_1_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_2__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_2",
      "top" : "max_pooling2d_2_output"
    },
    {
      "name" : "batch_normalization_2",
      "bottom" : "max_pooling2d_2_output",
      "weights" : {

      },
      "top" : "batch_normalization_2_output",
      "C" : 96,
      "blob_batchnorm_params" : 11,
      "type" : "batchnorm"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_2_output",
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 0,
      "bottom" : "batch_normalization_2_output",
      "pad_l" : 1,
      "name" : "zero_padding2d_2",
      "weights" : {

      }
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_3__activation___output",
      "blob_weights" : 15,
      "K" : 96,
      "blob_biases" : 13,
      "name" : "conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "zero_padding2d_2_output",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2d_3__activation___output",
      "pad_l" : 0,
      "name" : "max_pooling2d_3",
      "top" : "max_pooling2d_3_output"
    },
    {
      "bottom" : "max_pooling2d_3_output",
      "weights" : {

      },
      "mode" : 1,
      "hint_fallback_from_metal" : 1,
      "top" : "flatten_1_output",
      "type" : "flatten",
      "name" : "flatten_1"
    },
    {
      "nB" : 12544,
      "top" : "dense_1__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 19,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "flatten_1_output",
      "blob_biases" : 17,
      "has_tanh" : 0,
      "hint_fallback_from_metal" : 1,
      "name" : "dense_1",
      "has_prelu" : 0
    },
    {
      "nB" : 512,
      "top" : "dense_2__activation___output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 512,
      "blob_weights" : 23,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "dense_1__activation___output",
      "blob_biases" : 21,
      "has_tanh" : 0,
      "name" : "dense_2",
      "has_prelu" : 0
    },
    {
      "nB" : 512,
      "top" : "dense_3_output",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 27,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_2__activation___output",
      "blob_biases" : 25,
      "has_tanh" : 0,
      "name" : "dense_3",
      "has_prelu" : 0
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "output1",
      "type" : "softmax",
      "name" : "dense_3__activation__",
      "bottom" : "dense_3_output"
    }
  ]
}