<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/MZMLModels-Swift.h</key>
		<data>
		hNWnw9B4gAosHsrmIO9tWvpz57c=
		</data>
		<key>Headers/MZMLModels-umbrella.h</key>
		<data>
		gAJxP4yJq9Lbkc87ixFnajFER3c=
		</data>
		<key>Info.plist</key>
		<data>
		peS7sSBaXWg/UNujpEq9LVLhRI8=
		</data>
		<key>MZGenderModel.mlmodelc/coremldata.bin</key>
		<data>
		DkymFPJs2PwzrH1Dpub0mWKXefI=
		</data>
		<key>MZGenderModel.mlmodelc/model.espresso.net</key>
		<data>
		Z3beRHseWXukaIjddPQBp52D5Yk=
		</data>
		<key>MZGenderModel.mlmodelc/model.espresso.shape</key>
		<data>
		csKyjR5j8N96apQRvzRf4P40AIk=
		</data>
		<key>MZGenderModel.mlmodelc/model.espresso.weights</key>
		<data>
		TPWEvWw4df+RVBhbnZkIGfY6yhY=
		</data>
		<key>MZGenderModel.mlmodelc/model/coremldata.bin</key>
		<data>
		pFUUAdW3ifSa4zRiJ3IvU/itSbs=
		</data>
		<key>MZGenderModel.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		4SnyfFEDvFzES83woV4WDURQZv8=
		</data>
		<key>Modules/MZMLModels.swiftmodule/x86_64.swiftdoc</key>
		<data>
		y9nLmP9/7DHc3aBDY9oRGDdat9U=
		</data>
		<key>Modules/MZMLModels.swiftmodule/x86_64.swiftmodule</key>
		<data>
		B5FstN+L0XQ1p0cVtT+2j7ttmDM=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		bytdyl1Op4lLibF6+24evpzppI8=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/MZMLModels-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			CZ+9pMJ4PvgeacTjPaLCcG8X0uggYSWyGHlFC9krm0A=
			</data>
		</dict>
		<key>Headers/MZMLModels-umbrella.h</key>
		<dict>
			<key>hash2</key>
			<data>
			Rw/iswjMq4icyXgNuRZei5Hec/NiWgsW2VaVjOsLAe0=
			</data>
		</dict>
		<key>MZGenderModel.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			ESC3L6m1f/JmfDsjLb9KCt0jCg/5AXE27NZPYwKVbhM=
			</data>
		</dict>
		<key>MZGenderModel.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			JgYI2P+KF7ew9fNfMlLP3evQPqVocpQj9RkCeBWA5KI=
			</data>
		</dict>
		<key>MZGenderModel.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			iHRuCgA77GcJJwxmTo4bfmDWPMlnNMlvMfJc1fo48qQ=
			</data>
		</dict>
		<key>MZGenderModel.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			LKH4Qmn2ktybprHE60f5M/BXB/RzZlZdGRsv4RRHoUo=
			</data>
		</dict>
		<key>MZGenderModel.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			W+do8P58h2lBkax5j/f9Z6+MlT5JVf2tBD80kq6Uk0I=
			</data>
		</dict>
		<key>MZGenderModel.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			N0cI//dxndWXnsh11WzSKG9tPPfsMXo7JWMqqyjsN7s=
			</data>
		</dict>
		<key>Modules/MZMLModels.swiftmodule/x86_64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			Yf8G65UgxVzWu/JG0w9MUf5cqNtJfcwgtj/bxOCfawE=
			</data>
		</dict>
		<key>Modules/MZMLModels.swiftmodule/x86_64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			j43Ap1olLiB1yMBfyeRr1q85mlj1Py1Hn4gx0uWAQ40=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			HMJ5C6+/8T31gbcdfLL53D7i09eboztYYW/479HWmrM=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
